# 04. Manipulating the data

In [88]:
import pandas as pd
import numpy as np

## 02. Concatenating

In [89]:
df1 = pd.DataFrame(np.full((2,3),'x', dtype=object), columns=['A', 'B', 'C'])
df1

   A  B  C
0  x  x  x
1  x  x  x

In [90]:
df2 = pd.DataFrame(np.full((3,3),'o', dtype=object), columns=['A', 'B', 'C'])
df2

   A  B  C
0  o  o  o
1  o  o  o
2  o  o  o

In [91]:
df3 = pd.DataFrame(np.full((2,2),'v', dtype=object), columns=['D', 'E'])
df3

   D  E
0  v  v
1  v  v

### Concatenation along axis 0

In [92]:
pd.concat([df1,df2])

   A  B  C
0  x  x  x
1  x  x  x
0  o  o  o
1  o  o  o
2  o  o  o

In [93]:
# reset index
pd.concat([df1,df2]).reset_index(drop=True)

   A  B  C
0  x  x  x
1  x  x  x
2  o  o  o
3  o  o  o
4  o  o  o

In [94]:
pd.concat([df1,df3])

C:\Users\valen\anaconda3\envs\exts-ml\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C    D    E
0    x    x    x  NaN  NaN
1    x    x    x  NaN  NaN
0  NaN  NaN  NaN    v    v
1  NaN  NaN  NaN    v    v

### The keys parameter

In [95]:
df4 = pd.concat([df1,df2], keys=['df1', 'df2'])
df4

       A  B  C
df1 0  x  x  x
    1  x  x  x
df2 0  o  o  o
    1  o  o  o
    2  o  o  o

In [96]:
df4.loc['df2',:]

   A  B  C
0  o  o  o
1  o  o  o
2  o  o  o

### Concatenating along axis 1

In [97]:
pd.concat([df1, df3], axis=1)

   A  B  C  D  E
0  x  x  x  v  v
1  x  x  x  v  v

In [98]:
pd.concat([df1,df2], axis=1)

     A    B    C  A  B  C
0    x    x    x  o  o  o
1    x    x    x  o  o  o
2  NaN  NaN  NaN  o  o  o

### The join parameter

In [99]:
pd.concat([df1,df2], axis=1, join='inner')

   A  B  C  A  B  C
0  x  x  x  o  o  o
1  x  x  x  o  o  o

In [100]:
pd.concat([df1,df3], join='inner')

Empty DataFrame
Columns: []
Index: [0, 1, 0, 1]

##  03. Merging and joining

### Merging on a single column

In [101]:
users = pd.DataFrame( {'userID': [5672, 3452, 2878, 3234],
                'First Name': ['Christopher', 'Johnnie', 'Debbie', 'Teri'],
                'Last Name': ['Boyd','Baldwin', 'Alvarez', 'Gill']})
users

   userID   First Name Last Name
0    5672  Christopher      Boyd
1    3452      Johnnie   Baldwin
2    2878       Debbie   Alvarez
3    3234         Teri      Gill

In [102]:
scores = pd.DataFrame( {'userID': [2878, 5672, 3234, 5672, 2878],
                'Score': [84,56,72,77,88]})
scores

   userID  Score
0    2878     84
1    5672     56
2    3234     72
3    5672     77
4    2878     88

In [103]:
merged_df = pd.merge(users, scores) 
merged_df

   userID   First Name Last Name  Score
0    5672  Christopher      Boyd     56
1    5672  Christopher      Boyd     77
2    2878       Debbie   Alvarez     84
3    2878       Debbie   Alvarez     88
4    3234         Teri      Gill     72

In [104]:
scores2 = pd.DataFrame( {'studentID': [2878, 5672, 3234, 5672, 2878],
                'Score': [84,56,72,77,88]})

In [105]:
pd.merge(users, scores2, left_on='userID', right_on='studentID')

   userID   First Name Last Name  studentID  Score
0    5672  Christopher      Boyd       5672     56
1    5672  Christopher      Boyd       5672     77
2    2878       Debbie   Alvarez       2878     84
3    2878       Debbie   Alvarez       2878     88
4    3234         Teri      Gill       3234     72

In [106]:
pd.merge(users, scores2, left_on='userID', right_on='studentID')

   userID   First Name Last Name  studentID  Score
0    5672  Christopher      Boyd       5672     56
1    5672  Christopher      Boyd       5672     77
2    2878       Debbie   Alvarez       2878     84
3    2878       Debbie   Alvarez       2878     88
4    3234         Teri      Gill       3234     72

### Merging on multiple columns

In [107]:
gold = pd.DataFrame({'Code': ['CAN', 'GER', 'USA', 'NOR'],
               'Country': ['Canada', 'Germany', 'United States', 'Norway'],
               'Total': [ 14, 10, 9, 9]})
gold

  Code        Country  Total
0  CAN         Canada     14
1  GER        Germany     10
2  USA  United States      9
3  NOR         Norway      9

In [108]:
bronze= pd.DataFrame({'Code': ['USA','GER', 'NOR', 'AUS'],
               'Country': ['United States', 'Germany', 'Norway', 'Austria'],
               'Total': [ 13, 7, 7, 6]})
bronze

  Code        Country  Total
0  USA  United States     13
1  GER        Germany      7
2  NOR         Norway      7
3  AUS        Austria      6

In [109]:
pd.merge(gold,bronze)

Empty DataFrame
Columns: [Code, Country, Total]
Index: []

In [110]:
pd.merge(gold, bronze, on=['Code', 'Country'], suffixes=['_gold', '_bronze'])

  Code        Country  Total_gold  Total_bronze
0  GER        Germany          10             7
1  USA  United States           9            13
2  NOR         Norway           9             7

### Different types of joins

In [111]:
pd.merge(gold, bronze, on=['Code', 'Country'], suffixes=['_gold', '_bronze'], how='outer')

  Code        Country  Total_gold  Total_bronze
0  CAN         Canada        14.0           NaN
1  GER        Germany        10.0           7.0
2  USA  United States         9.0          13.0
3  NOR         Norway         9.0           7.0
4  AUS        Austria         NaN           6.0

In [112]:
pd.merge(gold, bronze, on=['Code', 'Country'], suffixes=['_gold', '_bronze'], how='left')

  Code        Country  Total_gold  Total_bronze
0  CAN         Canada          14           NaN
1  GER        Germany          10           7.0
2  USA  United States           9          13.0
3  NOR         Norway           9           7.0

In [113]:
pd.merge(gold, bronze, on=['Code', 'Country'], suffixes=['_gold', '_bronze'], how='right')

  Code        Country  Total_gold  Total_bronze
0  GER        Germany        10.0             7
1  USA  United States         9.0            13
2  NOR         Norway         9.0             7
3  AUS        Austria         NaN             6

In [114]:
df1 = pd.DataFrame({'key': [1,2,3,4], 'val1': [1,2,3,4]})
df2 = pd.DataFrame({'key': [1,2,3,5], 'val2': [1,2,3,4]})
df2

   key  val2
0    1     1
1    2     2
2    3     3
3    5     4

In [115]:
df_in = df1.merge(df2, how='inner')
df_in

   key  val1  val2
0    1     1     1
1    2     2     2
2    3     3     3

In [116]:
df_out = df1.merge(df2, how='outer')
df_out

   key  val1  val2
0    1   1.0   1.0
1    2   2.0   2.0
2    3   3.0   3.0
3    4   4.0   NaN
4    5   NaN   4.0

## 04. Exercise: merging with different joins

In [117]:
left = pd.DataFrame({'key1': ['a', 'b', 'c'], 'key2': ['A', 'B', 'C'], 'lval': [ 0, 1, 2]})
right = pd.DataFrame({'key1': ['a', 'b', 'c'], 'key2': ['A', 'D', 'C'], 'rval': [ 3, 4, 6]})

In [118]:
left

  key1 key2  lval
0    a    A     0
1    b    B     1
2    c    C     2

In [119]:
right

  key1 key2  rval
0    a    A     3
1    b    D     4
2    c    C     6

In [120]:
# A
pd.merge(left,right)

  key1 key2  lval  rval
0    a    A     0     3
1    c    C     2     6

In [121]:
#b
pd.merge(left,right, how='outer')

  key1 key2  lval  rval
0    a    A   0.0   3.0
1    b    B   1.0   NaN
2    c    C   2.0   6.0
3    b    D   NaN   4.0

In [122]:
#C
pd.merge(left,right,how='right')

  key1 key2  lval  rval
0    a    A   0.0     3
1    c    C   2.0     6
2    b    D   NaN     4

In [123]:
pd.merge(left,right, on='key1')
#pd.merge(left,right, on='key1', how='left')
#pd.merge(left,right, on='key1', how='right')
pd.merge(left,right, on='key1', how='outer')

  key1 key2_x  lval key2_y  rval
0    a      A     0      A     3
1    b      B     1      D     4
2    c      C     2      C     6

## 05. Pivoting

In [124]:
values = [3, 81, 1, 56, 71, 91, 54, 94, 64, 90, 21, 36]
coordinates = ['x','y','z'] * 4
time = [0]*3 + [1]*3 + [2]*3 + [3]*3
df = pd.DataFrame({'time':time, 'coordinates':coordinates, 'values':values})
df

    time coordinates  values
0      0           x       3
1      0           y      81
2      0           z       1
3      1           x      56
4      1           y      71
5      1           z      91
6      2           x      54
7      2           y      94
8      2           z      64
9      3           x      90
10     3           y      21
11     3           z      36

In [125]:
df_pivot = df.pivot(index='time', columns='coordinates', values='values')
df_pivot

coordinates   x   y   z
time
0             3  81   1
1            56  71  91
2            54  94  64
3            90  21  36

In [126]:
values2=[6,82,9,47,8,12,64,88,53,46,59,60]

In [127]:
df2=pd.DataFrame({'time':time*2, 'coordinates':coordinates*2, 'values':values+values2})
df2

    time coordinates  values
0      0           x       3
1      0           y      81
2      0           z       1
3      1           x      56
4      1           y      71
5      1           z      91
6      2           x      54
7      2           y      94
8      2           z      64
9      3           x      90
10     3           y      21
11     3           z      36
12     0           x       6
13     0           y      82
14     0           z       9
15     1           x      47
16     1           y       8
17     1           z      12
18     2           x      64
19     2           y      88
20     2           z      53
21     3           x      46
22     3           y      59
23     3           z      60

In [128]:
df2_pivot = df2.pivot_table(index='time', columns='coordinates', values='values')
df2_pivot

coordinates     x     y     z
time
0             4.5  81.5   5.0
1            51.5  39.5  51.5
2            59.0  91.0  58.5
3            68.0  40.0  48.0

In [129]:
import numpy as np
def distance(a):
    x = np.max(a) - np.min(a)
    return x

df2_pivot = df2.pivot_table(index='time', columns='coordinates', values='values', aggfunc=distance)
df2_pivot

coordinates   x   y   z
time
0             3   1   8
1             9  63  79
2            10   6  11
3            44  38  24

In [130]:
df2_pivot = df2.pivot_table(index='time', columns='coordinates', values='values', aggfunc=lambda x: tuple(x))
df2_pivot

coordinates         x         y         z
time
0              (3, 6)  (81, 82)    (1, 9)
1            (56, 47)   (71, 8)  (91, 12)
2            (54, 64)  (94, 88)  (64, 53)
3            (90, 46)  (21, 59)  (36, 60)

In [131]:
df2_pivot = df2.pivot_table(index='time', columns='coordinates', values='values', aggfunc=tuple)
df2_pivot

coordinates         x         y         z
time
0              (3, 6)  (81, 82)    (1, 9)
1            (56, 47)   (71, 8)  (91, 12)
2            (54, 64)  (94, 88)  (64, 53)
3            (90, 46)  (21, 59)  (36, 60)

## 06. Exercise: pivoting

In [132]:
df_song = pd.read_csv('data\songs.csv')
df_song.head()

       Musician      Genre                Name  Decade Minutes
0  Led Zeppelin  hard rock  Stairway to Heaven      70   08:02
1  Led Zeppelin  hard rock             Kashmir      70   08:37
2  Led Zeppelin  hard rock      Immigrant Song      70   02:26
3  Led Zeppelin  hard rock    Whole Lotta Love      60   05:33
4  Led Zeppelin  hard rock           Black Dog      70   04:55

In [133]:
def set_x(minutes):
    return 'x'

df_song_pivot = df_song.pivot_table(index=['Decade','Musician', 'Name' ], columns='Genre', values='Minutes',aggfunc=set_x, fill_value=' ')

df_song_pivot

Genre                                          folk rock  hard rock pop rock
Decade Musician     Name
60     Bob Dylan    Blowin' in the Wind                 x
                    Like a Rolling Stone                x
       David Bowie  Space Oddity                                           x
       Led Zeppelin Good Times Bad Times                          x
                    I Can't Quit You Baby                         x
                    Moby Dick                                     x
                    Ramble On                                     x
                    Whole Lotta Love                              x
70     Bob Dylan    Tangled Up in Blue                  x
       David Bowie  China Girl                                             x
                    Golden Years                                           x
                    Rebel Rebel                                            x
       Led Zeppelin All My Love                                   x
                    Black Dog                                     x
                    Immigrant Song                                x
                    Kashmir                                       x
                    Stairway to Heaven                            x
                    The Song Remains the Same                     x
80     David Bowie  Under Pressure                                         x
90     David Bowie  I'm Afraid of Americans                                x

## 08. Stacking and unstacking
* the stack() function takes the innermost column label and turns it into the innermost row index. The overall effect is to make the DataFrame taller.
* the unstack() function is the inverse operation: it takes the innermost row index and turns it into the innermost column label. The overall effect is to make the DataFrame wider.

In [134]:
#define the MultiIndex for the rows
row_levels = [['R0','R1'], ['r00', 'r01', 'r10', 'r11']]
row_labels = [[0,0,1,1],[0,1,2,3]]
row_indices = pd.MultiIndex(row_levels, row_labels)
#define the MultiIndex for the columns
col_levels = [['C0','C1'], ['c00', 'c01', 'c10', 'c11']]
col_labels = [[0,0,1,1],[0,1,2,3]]
col_indices = pd.MultiIndex(col_levels, col_labels)
#define the data
data = np.arange(16).reshape(4,4)
#create the dataframe
df = pd.DataFrame(data, index=row_indices, columns=col_indices)
df

        C0      C1
       c00 c01 c10 c11
R0 r00   0   1   2   3
   r01   4   5   6   7
R1 r10   8   9  10  11
   r11  12  13  14  15

In [136]:
df.stack()

              C0    C1
R0 r00 c00   0.0   NaN
       c01   1.0   NaN
       c10   NaN   2.0
       c11   NaN   3.0
   r01 c00   4.0   NaN
       c01   5.0   NaN
       c10   NaN   6.0
       c11   NaN   7.0
R1 r10 c00   8.0   NaN
       c01   9.0   NaN
       c10   NaN  10.0
       c11   NaN  11.0
   r11 c00  12.0   NaN
       c01  13.0   NaN
       c10   NaN  14.0
       c11   NaN  15.0

In [138]:
df.unstack()

     C0                                        C1                             \
    c00                  c01                  c10                   c11
    r00  r01  r10   r11  r00  r01  r10   r11  r00  r01   r10   r11  r00  r01
R0  0.0  4.0  NaN   NaN  1.0  5.0  NaN   NaN  2.0  6.0   NaN   NaN  3.0  7.0
R1  NaN  NaN  8.0  12.0  NaN  NaN  9.0  13.0  NaN  NaN  10.0  14.0  NaN  NaN



     r10   r11
R0   NaN   NaN
R1  11.0  15.0

In [139]:
df.stack(level=0)

            c00   c01   c10   c11
R0 r00 C0   0.0   1.0   NaN   NaN
       C1   NaN   NaN   2.0   3.0
   r01 C0   4.0   5.0   NaN   NaN
       C1   NaN   NaN   6.0   7.0
R1 r10 C0   8.0   9.0   NaN   NaN
       C1   NaN   NaN  10.0  11.0
   r11 C0  12.0  13.0   NaN   NaN
       C1   NaN   NaN  14.0  15.0

## 09. Grouping

### Grouping by a single variable

In [141]:

raw_data = {'team': ['Ten Snakes', 'Ten Snakes', 'Ten Snakes', 'Ten Snakes', 
                                    'Nine Monkeys', 'Nine Monkeys', 'Nine Monkeys', 'Nine Monkeys', 
                                    'Eight Eagles', 'Eight Eagles'], 
        'rank': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '2nd'], 
        'name': ['James', 'Allen', 'Matthew', 'James', 'Devon', 'Sam', 'Justin', 'Sam', 'Paul', 'Ross'], 
        'score1': [16,35,55,29,2,61,68,41,94,18],
        'score2': [81,65,54,44,28,93,2,5,53,99]}
df = pd.DataFrame(raw_data, columns = ['team', 'rank', 'name', 'score1', 'score2'])

In [151]:
grouped=df.groupby('team')
grouped.head()

           team rank     name  score1  score2
0    Ten Snakes  1st    James      16      81
1    Ten Snakes  1st    Allen      35      65
2    Ten Snakes  2nd  Matthew      55      54
3    Ten Snakes  2nd    James      29      44
4  Nine Monkeys  1st    Devon       2      28
5  Nine Monkeys  1st      Sam      61      93
6  Nine Monkeys  2nd   Justin      68       2
7  Nine Monkeys  2nd      Sam      41       5
8  Eight Eagles  1st     Paul      94      53
9  Eight Eagles  2nd     Ross      18      99

In [152]:
list(grouped)

[('Eight Eagles',
             team rank  name  score1  score2
  8  Eight Eagles  1st  Paul      94      53
  9  Eight Eagles  2nd  Ross      18      99),
 ('Nine Monkeys',
             team rank    name  score1  score2
  4  Nine Monkeys  1st   Devon       2      28
  5  Nine Monkeys  1st     Sam      61      93
  6  Nine Monkeys  2nd  Justin      68       2
  7  Nine Monkeys  2nd     Sam      41       5),
 ('Ten Snakes',
           team rank     name  score1  score2
  0  Ten Snakes  1st    James      16      81
  1  Ten Snakes  1st    Allen      35      65
  2  Ten Snakes  2nd  Matthew      55      54
  3  Ten Snakes  2nd    James      29      44)]

In [153]:
grouped.describe()

             score1                                                   score2  \
              count   mean        std   min    25%   50%    75%   max  count
team
Eight Eagles    2.0  56.00  53.740115  18.0  37.00  56.0  75.00  94.0    2.0
Nine Monkeys    4.0  43.00  29.631065   2.0  31.25  51.0  62.75  68.0    4.0
Ten Snakes      4.0  33.75  16.235250  16.0  25.75  32.0  40.00  55.0    4.0


              mean        std   min    25%   50%    75%   max
team
Eight Eagles  76.0  32.526912  53.0  64.50  76.0  87.50  99.0
Nine Monkeys  32.0  42.292631   2.0   4.25  16.5  44.25  93.0
Ten Snakes    61.0  15.853496  44.0  51.50  59.5  69.00  81.0

In [155]:
grouped.size()

team
Eight Eagles    2
Nine Monkeys    4
Ten Snakes      4
dtype: int64

In [157]:
grouped.count()

              rank  name  score1  score2
team
Eight Eagles     2     2       2       2
Nine Monkeys     4     4       4       4
Ten Snakes       4     4       4       4

In [158]:
grouped.get_group('Ten Snakes')

  rank     name  score1  score2
0  1st    James      16      81
1  1st    Allen      35      65
2  2nd  Matthew      55      54
3  2nd    James      29      44

### Grouping by multiple index levels

In [159]:
df2 = df.set_index(['team','rank'])
df2

                      name  score1  score2
team         rank
Ten Snakes   1st     James      16      81
             1st     Allen      35      65
             2nd   Matthew      55      54
             2nd     James      29      44
Nine Monkeys 1st     Devon       2      28
             1st       Sam      61      93
             2nd    Justin      68       2
             2nd       Sam      41       5
Eight Eagles 1st      Paul      94      53
             2nd      Ross      18      99

In [165]:
grouped2 = df2.groupby(level=['team', 'rank'])
grouped2.size()

team          rank
Eight Eagles  1st     1
              2nd     1
Nine Monkeys  1st     2
              2nd     2
Ten Snakes    1st     2
              2nd     2
dtype: int64

In [166]:
grouped2.get_group(('Eight Eagles','1st'))

                   name  score1  score2
team         rank
Eight Eagles 1st   Paul      94      53

In [167]:
# applying a function
grouped.agg(np.sum)

              score1  score2
team
Eight Eagles     112     152
Nine Monkeys     172     128
Ten Snakes       135     244

In [168]:
grouped2.agg(np.sum)

                   score1  score2
team         rank
Eight Eagles 1st       94      53
             2nd       18      99
Nine Monkeys 1st       63     121
             2nd      109       7
Ten Snakes   1st       51     146
             2nd       84      98

### Filtering by groups

In [171]:
def f(x):
    m = x.mean()
    return (m.score1 > 50) & (m.score2 > 50)

In [172]:
grouped.filter(f)

  rank  name  score1  score2
8  1st  Paul      94      53
9  2nd  Ross      18      99

## 10. Exercise: grouping and filtering

In [180]:
def f(x):
    min = x.min()
    return (x.score1.min()>50) & (x.score2.min()>50)

In [183]:
grouped2.filter(f)

                   name  score1  score2
team         rank
Eight Eagles 1st   Paul      94      53